Revit 2027 API
BeamSystem.Level Property
Get or change the level of the BeamSystem. When the level is changed, the elevation is changed to make the the BeamSystem remain the location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Level Level { get; set; }
Public Property Level As Level
	Get
	Set
public:
property Level^ Level {
	Level^ get ();
	void set (Level^ value);
}
member Level : Level with get, set
Property Value
Level
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace